<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2016 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: niuchao
// +----------------------------------------------------------------------
/**
 * 此配置专为appapi使用可避免与原来的配置冲突
 */
//配置常量示例
define('APPAPI','appapi');
//return 中可配置框架的其他所需要的相关配置
return [
    /**
     * 配置appapi模块输出的数据格式为json
     */
    'default_return_type'=>'json'
];

